###4번
score = int(input("점수를 입력하세요 : "))

if score >= 90:
    print("장학생")
elif score >= 60:
    print("합격")
else:
    print("불합격")

print("입니다. ^^")

###5번 =>답 : 3번
num = 5
res = '짝수' if num % 2 == 0 else '홀수'
print(res)

###6번
nn = [100, 200, 300, 400, 500]
nn[1] = 777         #답 : [100, 777, 300, 400, 500]
nn[1] = [444,555]   #답 : [100, [444, 555], 300, 400, 500]
nn[1:4] = [444,555] #답 : [100, 444, 555, 500]
nn[2:] = []         #답 : [100, 200]

###9번 => 답 : 40722
total = 0
num = 0

for num in range(3333, 9999):
    if num % 1234 != 0:
        continue
    if total + num >= 100000:
        break
    total = total + num

print("십만이 넘기 직전까지의 1234의 배수의 합계:", total)

###8번
hap = 0
n = 1234

while n < 4568:
    if n % 444 == 0:
        hap += n
    n += 1

print(hap)

###14번 심화문제 =>답 : [[2, 4], [3, 6]]
myData = [[n*m for n in range(1,3) ] for m in range(2,4)]
print(myData)

###5번(오른쪽 아래 문제)
nn = [100, 200, 300, 400, 500]
nn[4]         #답 : 500
nn[-1]        #답 : 500
nn[-2]        #답 : 400
nn[1:4]       #답 : [200, 300, 400]
nn[0:1]       #답 : [100]
nn[2:-1]      #답 : [300, 400]
nn[0::2]      #답 : [100, 300, 500]
nn[::-1]      #답 : [500, 400, 300, 200, 100]
nn[::-2]      #답 : [500, 300, 100]
